КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы/КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы</name>
  <resources>
    <name>ОповещениеТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОповещениеАдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СценарииАвтоматическойРаботы</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_СценарииАвтоматическойРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЛогистика</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектОбработки</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм</name>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелефонНеЗарегестрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьОшибку(СценарииАвтоматическойРаботы, ОбъектОбработки, ТекстОшибки) Экспорт
	
	Если ЗначениеЗаполнено(ОбъектОбработки) Тогда
		ТипДокументаСтрокой = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоСсылкеНаДокумент(ОбъектОбработки);
		ТипЛогистика = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЛогистическийТипПоТипуДокумента(ТипДокументаСтрокой);
	Иначе
		ТипЛогистика = Неопределено;
	КонецЕсли;
	
	// Добавляем письмо в очередь
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СценарииАвтоматическойРаботы.Установить(СценарииАвтоматическойРаботы);
	НаборЗаписей.Отбор.ТипЛогистика.Установить(ТипЛогистика);
	НаборЗаписей.Отбор.ОбъектОбработки.Установить(ОбъектОбработки);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ТекущаяЗапись = НаборЗаписей.Добавить();
		ТекущаяЗапись.СценарииАвтоматическойРаботы = СценарииАвтоматическойРаботы;
		ТекущаяЗапись.ТипЛогистика = ТипЛогистика;
		ТекущаяЗапись.ОбъектОбработки = ОбъектОбработки;
		
		Отправитель = Неопределено;
		ИспользоватьОтправкуВТелеграм = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
		ИспользоватьОтправкуНаПочту = КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
		
		Если ИспользоватьОтправкуВТелеграм Или ИспользоватьОтправкуНаПочту Тогда
			
			// Рассчитаем реквизиты отправки по документу
			Если ЗначениеЗаполнено(ОбъектОбработки) Тогда
				Отправитель = ОтправительПоДокументу(СценарииАвтоматическойРаботы, ОбъектОбработки);
				
				Если ЗначениеЗаполнено(Отправитель) Тогда
					ТекущаяЗапись.ОповещениеТелефон = Отправитель.ТелефонУведомленияОшибокРоботов;
					ТекущаяЗапись.ОповещениеАдресЭлектроннойПочты = Отправитель.АдресЭлектроннойПочтыУведомленияОшибокРоботов;
				КонецЕсли;
			КонецЕсли;
			
			// Если не удалось взять по документу, то берем из сценария
			Если Не ЗначениеЗаполнено(ТекущаяЗапись.ОповещениеТелефон)
				И Не ЗначениеЗаполнено(ТекущаяЗапись.ОповещениеАдресЭлектроннойПочты) Тогда
				
				ТекущаяЗапись.ОповещениеТелефон = СценарииАвтоматическойРаботы.ТелефонУведомленияОшибокРоботов;
				ТекущаяЗапись.ОповещениеАдресЭлектроннойПочты = СценарииАвтоматическойРаботы.АдресЭлектроннойПочтыУведомленияОшибокРоботов;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИспользоватьОтправкуВТелеграм И ЗначениеЗаполнено(ТекущаяЗапись.ОповещениеТелефон) Тогда
			
			// Поставим в очередь сообщение на отправку
			ПоставитьСообщениеВОчередьНаОтправкуВТелеграм(
				ТекущаяЗапись.ОповещениеТелефон, СценарииАвтоматическойРаботы, ОбъектОбработки, ТекстОшибки, Отправитель);
			
		КонецЕсли;
		
		Если ИспользоватьОтправкуНаПочту И ЗначениеЗаполнено(ТекущаяЗапись.ОповещениеАдресЭлектроннойПочты) Тогда
			
			// Отправляем письмо на почту
			ОтправитьСообщениеНаАдресЭлектроннойПочты(
				ТекущаяЗапись.ОповещениеАдресЭлектроннойПочты, СценарииАвтоматическойРаботы, ОбъектОбработки, ТекстОшибки, Отправитель);
			
		КонецЕсли;
		
	Иначе
		ТекущаяЗапись = НаборЗаписей[0];
	КонецЕсли;
	
	ТекущаяЗапись.ТекстОшибки = ТекстОшибки;
	ТекущаяЗапись.ДатаСобытия = ТекущаяДатаСеанса();
	
	// Нет смысла фиксировать пустой текст ошибки
	Если ТекстОшибки = "" Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПредставлениеКоличестваОшибок(ТипЛогистика = Неопределено) Экспорт
	
	ПредставлениеКоличестваОшибок = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипЛогистика", ТипЛогистика);
	Запрос.УстановитьПараметр("ТипЛогистикаЗаполнена", ЗначениеЗаполнено(ТипЛогистика));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.ОбъектОбработки) КАК КоличествоОшибок,
	|	МИНИМУМ(КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.ДатаСобытия) КАК МинимальнаяДатаСобытия
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы КАК КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы
	|ГДЕ
	|	(&ТипЛогистикаЗаполнена
	|				И КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.ТипЛогистика = &ТипЛогистика
	|			ИЛИ НЕ &ТипЛогистикаЗаполнена)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.КоличествоОшибок = 0 Тогда
			ПредставлениеКоличестваОшибок = "";
		Иначе
			ПредставлениеКоличестваОшибок = Формат(Выборка.КоличествоОшибок, "ЧГ=0")
				+ " " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьОшибкиВСклонении(Выборка.КоличествоОшибок)
				+ " с " + Формат(Выборка.МинимальнаяДатаСобытия, "ДФ=dd.MM.yy");
		КонецЕсли;
		
	Иначе
		
		ПредставлениеКоличестваОшибок = "";
		
	КонецЕсли;
	
	Возврат ПредставлениеКоличестваОшибок;
	
КонецФункции

Процедура УдалитьЗапись(СценарииАвтоматическойРаботы, ОбъектОбработки = Неопределено) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СценарииАвтоматическойРаботы.Установить(СценарииАвтоматическойРаботы);
	НаборЗаписей.Отбор.ОбъектОбработки.Установить(ОбъектОбработки);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КоличествоОшибокПоТипуЛогистики(ТипЛогистика)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипЛогистика", ТипЛогистика);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.ОбъектОбработки) КАК ОбъектОбработки
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы КАК КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы
	|ГДЕ
	|	КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.ТипЛогистика = &ТипЛогистика";
	
	Резульата = Запрос.Выполнить();
	
	Если Резульата.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Резульата.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ОбъектОбработки;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ОтправительПоДокументу(СценарииАвтоматическойРаботы, ОбъектОбработки)
	
	Попытка
		
		ДанныеФайлаОтправки = Справочники.КонтурЛогистика_ФайлыОбмена.ПолучитьОсновныеДанныеФайла(
			ОбъектОбработки, СценарииАвтоматическойРаботы.ТипЛогистическогоДокумента);
		Отправитель = ДанныеФайлаОтправки.Отправитель;
		
	Исключение
		
		Отправитель = Неопределено;
		
	КонецПопытки;
	
	Возврат Отправитель;
	
КонецФункции

Процедура ПоставитьСообщениеВОчередьНаОтправкуВТелеграм(Телефон, СценарииАвтоматическойРаботы, ОбъектОбработки, ТекстОшибки, Отправитель)
	
	ТекстЗаголовка = ТекстЗаголовкаСообщения(ОбъектОбработки);
	
	ФорматHTML = Ложь;
	ТекстСообщения = ТекстСообщенияОбОшибке(ТекстЗаголовка, СценарииАвтоматическойРаботы, ОбъектОбработки, ТекстОшибки, ФорматHTML, Отправитель);
	
	НовоеСообщение = КонтурЛогистика_РаботаСТелеграм.МанифестСообщения();
	НовоеСообщение.Тип = "text";
	НовоеСообщение.Данные = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьДвоичныеДанныеИзСтроки_КонтурЛогистика(ТекстСообщения);
	
	Сообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовоеСообщение);
	
	РегистрыСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДобавитьВОчередь(Телефон, Сообщения);
	
КонецПроцедуры

Процедура ОтправитьСообщениеНаАдресЭлектроннойПочты(АдресЭлектроннойПочты, СценарииАвтоматическойРаботы, ОбъектОбработки, ТекстОшибки, Отправитель)
	
	ТекстЗаголовка = ТекстЗаголовкаСообщения(ОбъектОбработки);
	
	ФорматHTML = Истина;
	ТекстСообщения = ТекстСообщенияОбОшибке(ТекстЗаголовка, СценарииАвтоматическойРаботы, ОбъектОбработки, ТекстОшибки, ФорматHTML, Отправитель);
	
	ШаблонПисьма = ШаблонПисьмаHTML();
	ТекстПисьма = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонПисьма, ТекстСообщения);
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = ТекстЗаголовка;
	Письмо.Тексты.Добавить(ТекстПисьма, ТипТекстаПочтовогоСообщения.HTML);
	
	Получатели = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(АдресЭлектроннойПочты, ";", Ложь);
	Для Каждого Получатель Из Получатели Цикл
		Письмо.Получатели.Добавить(Получатель);
	КонецЦикла;
	
	Попытка
		
		ТекстОшибкиОтправки = КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
		
		Если ЗначениеЗаполнено(ТекстОшибкиОтправки) Тогда
			ЗаписьЖурналаРегистрации("КонтурЛогистика_Робот_" + СценарииАвтоматическойРаботы,
				УровеньЖурналаРегистрации.Ошибка,, ОбъектОбработки, ТекстОшибкиОтправки);
		КонецЕсли;
		
	Исключение
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибкиОтправкиПочты = "Роботы, сценарий: " + Строка(СценарииАвтоматическойРаботы) + "
			|Текст ошибки: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ОбъектОбработки, ТекстОшибкиОтправкиПочты);
		
	КонецПопытки;
	
КонецПроцедуры

Функция ТекстЗаголовкаСообщения(ОбъектОбработки)
	
	Если ЗначениеЗаполнено(ОбъектОбработки) Тогда
		ТекстЗаголовка = "ОШИБКА ОБРАБОТКИ ДОКУМЕНТА";
	Иначе
		ТекстЗаголовка = "ОШИБКА АВТОМАТИЧЕСКОЙ ОБРАБОТКИ";
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

Функция ТекстСообщенияОбОшибке(ТекстЗаголовка, СценарииАвтоматическойРаботы, ОбъектОбработки, ТекстОшибки, ФорматHTML, Отправитель)
	
	Если ФорматHTML Тогда
		ШаблонЗаголовка = "<b>%1</b>";
		ШаблонСтроки = "<p>%1</p>";
		ШаблонСтрокиКода = "<p><code>%1</code></p>";
	Иначе
		ШаблонЗаголовка = "<b>%1</b>";
		ШаблонСтроки = "%1";
		ШаблонСтрокиКода = "<code>%1</code>";
	КонецЕсли;
	
	Строки = Новый Массив;
	
	// Заголовок для Телеграм
	Если Не ФорматHTML Тогда
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонЗаголовка, ТекстЗаголовка));
	КонецЕсли;
	
	// Отправитель
	Если ЗначениеЗаполнено(Отправитель) Тогда
		ОтправительПредставление = "Организация: " + Строка(Отправитель);
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтроки,
			?(ФорматHTML, "", Символы.ПС) + ОтправительПредставление + ?(ФорматHTML, "<br><br>", "")));
	КонецЕсли;
	
	// Объект обработки
	Если ЗначениеЗаполнено(ОбъектОбработки) Тогда
		ОбъектОбработкиПредставление = Строка(ОбъектОбработки);
	Иначе
		ОбъектОбработкиПредставление = Строка(СценарииАвтоматическойРаботы);
	КонецЕсли;
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтроки,
		?(ФорматHTML, "", Символы.ПС) + ОбъектОбработкиПредставление));
	
	// Текст ошибки
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтроки,
		?(ФорматHTML, "<br>", Символы.ПС) + "Текст ошибки:"));
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиКода,
		?(ФорматHTML, "<br>", "") + ТекстОшибки));
	
	ТекстСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Строки, Символы.ПС);
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ШаблонПисьмаHTML()
	
	Возврат
	"<!DOCTYPE html PUBLIC ""-//W3C//DTD HTML 4.0 Transitional//EN"">
	|<html>
	|<head content=""text/html"" http-equiv=""Content-Type"" charset="""">
	|<meta name=""format-detection""></meta>
	|<style type=""text/css"">
	| body {margin: 0; padding: 1px;}
	| p {line-height: 1.15; margin: 0; white-space: pre-wrap;}
	| p.gray {color: gray}
	| ol,ul {margin-top: 0; margin-bottom: 0;}
	| img {border: none;}
	| .css-body {font-family: ""Lab Grotesque"",-apple-system,system-ui,BlinkMacSystemFont,""Segoe UI"",""FSegoeUI"",Roboto,rouble,""Helvetica Neue"",Ubuntu,Arial,Tahoma,sans-serif;}
	| table {background-color: transparent}
	| th {text-align: left}
	| .table {max-width: 100%;}
	| .table>thead>tr>th,.table>tbody>tr>th,.table>tfoot>tr>th,.table>thead>tr>td,.table>tbody>tr>td,.table>tfoot>tr>td {padding: 1px;line-height: 1.42857143;vertical-align: top;border-top: 1px solid #ddd}
	|</style>
	|</head>
	|<body class=""css-body"">
	|	%1
	|	<br><div class=""css-line""></div>
	|	<p class=""gray"">Письмо сформировано автоматически, отвечать на него не нужно.</p>
	|</body></html>";
	
КонецФункции

#КонецОбласти

#КонецЕсли
